# 피봇테이블과 그룹분석 
    -피봇테이블을 사용하기 위해 pivot메소드 사용
    -(행,열,데이터)
    -데이터가 없다면 NaN 값을 넣는다.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ['도시','연도','인구','지역']
df1=pd.DataFrame(data,columns=columns);df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [3]:
df1.pivot('도시','연도','인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

# 시계열 자료 다루기 
        - Pandas에서 시계열 자료를 생성하려면 인덱스를 DatetimeIndex 자료형으로만들어야함
        - pd.to_datetime
        - pd.date_range

In [9]:
#pd.to_datetime : 날짜를 나타내는 문자열을 자동으로 datetime 자료형을 생성한다. 
date_str = ["2018, 1, 1", "2018, 1, 4", "2018, 1, 5", "2018, 1, 6"]
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-04', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [11]:
np.random.seed(0)
s = pd.Series(np.random.randn(4),index=idx);s

2018-01-01    1.764052
2018-01-04    0.400157
2018-01-05    0.978738
2018-01-06    2.240893
dtype: float64

In [12]:
#pd.date_range: 시작일과 종료일 또는 기간 입력시 범위내의 모든 인덱스 생성 
pd.date_range('2018-4-1','2018-4-30')

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [13]:
pd.date_range(start='2020-1-13',periods=15)

DatetimeIndex(['2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27'],
              dtype='datetime64[ns]', freq='D')

# frep인수로 특정 날짜만 생성되도록 할 수도 있다. 
예) frep = B (주말이 아닌 평일 )
M= 각 달의 마지막날

# shift연산
    - 인덱스는 그대로 두고 데이터만 이동시키기

In [16]:
np.random.seed(0)
ts = pd.Series(np.random.randn(4), index=pd.date_range(
    "2018-1-1", periods=4, freq="M"))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [17]:
ts.resample('10T').sum()

2018-01-31 00:00:00    1.764052
2018-01-31 00:10:00    0.000000
2018-01-31 00:20:00    0.000000
2018-01-31 00:30:00    0.000000
2018-01-31 00:40:00    0.000000
                         ...
2018-04-29 23:20:00    0.000000
2018-04-29 23:30:00    0.000000
2018-04-29 23:40:00    0.000000
2018-04-29 23:50:00    0.000000
2018-04-30 00:00:00    2.240893
Freq: 10T, Length: 12817, dtype: float64

In [19]:
ts.resample('5T').ohlc() #open.high,low.close

                         open      high       low     close
2018-01-31 00:00:00  1.764052  1.764052  1.764052  1.764052
2018-01-31 00:05:00       NaN       NaN       NaN       NaN
2018-01-31 00:10:00       NaN       NaN       NaN       NaN
2018-01-31 00:15:00       NaN       NaN       NaN       NaN
2018-01-31 00:20:00       NaN       NaN       NaN       NaN
...                       ...       ...       ...       ...
2018-04-29 23:40:00       NaN       NaN       NaN       NaN
2018-04-29 23:45:00       NaN       NaN       NaN       NaN
2018-04-29 23:50:00       NaN       NaN       NaN       NaN
2018-04-29 23:55:00       NaN       NaN       NaN       NaN
2018-04-30 00:00:00  2.240893  2.240893  2.240893  2.240893

[25633 rows x 4 columns]